//
//  QuestionData.swift
//  Homework46PsychologicalTest
//
//  Created by 黃柏嘉 on 2021/12/27.
//

import Foundation

class QuestionData{
    let question = [
        Question(QuestionSequence: 1, QuestionType: "精神狀態", Question: "下列四種海洋生物中，你想變成？", options: ["珊瑚","兩條魚","一群魚","一條海蛇"], result: ["選擇珊瑚的人，派表你的精神年齡還停留在『小朋友心態』，雖然你有夢想，也心懷遠方，但是！你不但有拖延症，做事缺乏行動力，屬於多說少做的、情緒微急躁的類型","選擇兩條魚的人，代表你是一個充滿矛盾的個體，看似堅強成熟，實際上內心脆弱敏感，面對陌生人時微內向溫和有禮，但只要多跟你見過幾次面就能知道其實你是個瘋狂的人！","選擇一群魚的人，代表你是一個害怕及的人，日常比較喜歡群體生活，性格方面你有選擇恐懼症，遇到選項時會偏好詢問身邊的人意見，依賴性很強。","選擇一條海蛇的人，代表你是一個相當成熟的人，對家庭有責任感、在事業上有上進心，性格較獨立，無論遇到什麼難題都會冷靜解決。不習慣示弱的個性，會用堅強偽裝自己所遇到的委屈、習慣自我消化，不過也因此常常感覺很累。"]),
        Question(QuestionSequence: 2, QuestionType: "對另一半的要求", Question: "如果你面前有一個湖泊，而你可以任意加點東西，你會選擇？", options: ["山","小魚","小屋","小鳥"], result: ["選擇山的人，代表你希望另一半是個有智慧、有能力，能帶給你安全感的人。","選擇小魚的人，代表你希望另一半是個成熟穩重、有擔當，他可以在小事上包容你，大事上又能夠引導你的人。","選擇小屋的人，代表你希望另一半事業有成，和他在一起後，可以無憂無慮隨心所欲過自己想過的生活。","選擇小鳥的人，代表你希望另一半外表、身材都要高水準，同時希望對方不是個愛黏你的人。"]),
        Question(QuestionSequence: 3, QuestionType: "對婚姻的看法", Question: "如果你有馴服動物的能力，你會選擇哪種當寵物？", options: ["豹","恐龍","老虎","北極熊"], result: ["選擇豹當寵物的人，代表雖然你想結婚，但卻不知道該如何經營婚姻，應該說你其實是很害怕婚後的生活還不如自己一個人過得自在。","選擇恐龍的人，代表你對婚姻很消極，認為世界上沒有完美的婚姻存在，結婚這件事對你來說可有可無，更注重的是現在的陪伴。","選擇老虎的人，代表你認為結婚是一件大事，既然決定走入婚姻殿堂，你勢必會超珍惜這段婚姻，並且盡最大力量去用心經營維護。","選擇北極熊的人，代表你有婚姻恐懼症，認為結婚只會失去自由，柴米油鹽、婆媳關係這些問題想想就頭痛啊～"]),
        Question(QuestionSequence: 4, QuestionType: "現在生活狀態", Question: "你想看到下列哪一種與水有關聯的景色？", options: ["大海","小溪","瀑布","湖泊"], result:["選擇大海的人，代表你要進入一個很棒的階段，屬於心想事成的狀態，你會遇到一些很不錯的機會，你的小願望也有可能會實現！","選擇小溪的人，代表你正想辦法扭轉現狀，雖然當下你充滿不安和徬徨，但你相信這些都只是暫時的。","選擇瀑布的人，代表你當下的狀態很不錯，而且未來一段時間的運勢也會不錯，所以去做你想做的事情，你會得到自己想要的結果的。","選擇湖泊的人，代表你的醒格很謹慎、做事多疑，對未來相當迷茫，內心焦慮、認為自己失敗，想改變卻不知道該怎麼做。"]),
        Question(QuestionSequence: 5, QuestionType: "最重視的是什麼", Question: "假設你騎腳踏車回家途中，突然發現自己掉了一樣東西、，因為趕時間沒辦法回去撿，你最不希望弄丟以下哪件物品？", options: ["手機","戀人送的物品","錢包","剛入手物品"], result: ["選擇手機的人，代表現階段你最看重的是友情。","選擇戀人送的有紀念性物品的人，代表你現在最看重的是愛情、內心渴望著被愛。","選擇錢包的人，代表現階段你最看重的是自己，而且時時刻刻都在計畫著如何提升自己。","選擇剛入手的心愛物品的人，代表現階段的你看中的是家庭與親情。"]),
        Question(QuestionSequence: 6, QuestionType: "對戀愛的態度", Question: "假設有一天你在森林裡迷路了，你覺得你會遇到什麼？", options: ["人","動物","仙女","小矮人"], result: ["選擇人的人，代表你根本不會輕易戀愛、接受他人，但是一但遇到對的人、開始戀愛後就會無時無刻抱著要結婚的想法相處。","選擇動物的人，代表你只會按照自己的喜好尋找愛人，不會受到他人的干擾，也絕對不會為了戀愛而戀愛。","選擇仙女的人，代表你認為戀愛和婚姻是兩碼事，無論多麼喜歡一個人、對未來有多憧憬，現實你就是不會想邁向下一個階段。","選擇小矮人的人，代表你喜歡刺激浪漫的愛情，一成不變的關係會讓你很快感到厭倦。"])
        
    ]
}
